1. Dataframes
   1. Reading csv
   2. Accessing columns
   3. Some common descriptive stats
2. Indexing

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("salaries.csv")

In [5]:
type(df)

pandas.DataFrame

In [6]:
df

       Name  Age           City  Salary   Department
0     Alice   25       New York   75000    Marketing
1       Bob   30  San Francisco   85000  Engineering
2   Charlie   35        Chicago   92000        Sales
3     David   40         Boston   78000           HR
4      Emma   28        Seattle   88000  Engineering
5     Frank   33         Austin   81000    Marketing
6     Grace   29         Denver   79000        Sales
7     Henry   42       Portland   95000  Engineering
8     Irene   31        Atlanta   72000           HR
9      Jack   38          Miami   86000        Sales
10    Karen   27         Dallas   77000    Marketing
11      Leo   36        Chicago   89000  Engineering
12      Mia   34        Seattle   83000        Sales
13     Noah   41       New York   91000           HR
14   Olivia   26  San Francisco   76000    Marketing
15     Paul   39         Boston   94000  Engineering
16    Quinn   32         Austin   80000        Sales
17   Rachel   37         Denver   87000           HR
18      Sam   29       Portland   82000    Marketing
19     Tina   43        Atlanta   96000  Engineering
20      Uma   31          Miami   79000        Sales
21   Victor   28         Dallas   84000           HR
22    Wendy   35        Chicago   90000    Marketing
23   Xavier   40        Seattle   93000  Engineering
24     Yara   33       New York   81000        Sales
25     Zack   27  San Francisco   78000           HR
26      Amy   36         Boston   85000    Marketing
27      Ben   30         Austin   89000  Engineering
28     Cara   34         Denver   77000        Sales
29      Dan   39       Portland   92000           HR

In [9]:
df.head(10)

      Name  Age           City  Salary   Department
0    Alice   25       New York   75000    Marketing
1      Bob   30  San Francisco   85000  Engineering
2  Charlie   35        Chicago   92000        Sales
3    David   40         Boston   78000           HR
4     Emma   28        Seattle   88000  Engineering
5    Frank   33         Austin   81000    Marketing
6    Grace   29         Denver   79000        Sales
7    Henry   42       Portland   95000  Engineering
8    Irene   31        Atlanta   72000           HR
9     Jack   38          Miami   86000        Sales

In [10]:
df.tail(5)

    Name  Age           City  Salary   Department
25  Zack   27  San Francisco   78000           HR
26   Amy   36         Boston   85000    Marketing
27   Ben   30         Austin   89000  Engineering
28  Cara   34         Denver   77000        Sales
29   Dan   39       Portland   92000           HR

- read the csv file
- display the first few rows

In [11]:
df.columns

Index(['Name', 'Age', 'City', 'Salary', 'Department'], dtype='str')

In [12]:
df['Salary']

0     75000
1     85000
2     92000
3     78000
4     88000
5     81000
6     79000
7     95000
8     72000
9     86000
10    77000
11    89000
12    83000
13    91000
14    76000
15    94000
16    80000
17    87000
18    82000
19    96000
20    79000
21    84000
22    90000
23    93000
24    81000
25    78000
26    85000
27    89000
28    77000
29    92000
Name: Salary, dtype: int64

In [13]:
df[['Salary', 'Name']]

    Salary     Name
0    75000    Alice
1    85000      Bob
2    92000  Charlie
3    78000    David
4    88000     Emma
5    81000    Frank
6    79000    Grace
7    95000    Henry
8    72000    Irene
9    86000     Jack
10   77000    Karen
11   89000      Leo
12   83000      Mia
13   91000     Noah
14   76000   Olivia
15   94000     Paul
16   80000    Quinn
17   87000   Rachel
18   82000      Sam
19   96000     Tina
20   79000      Uma
21   84000   Victor
22   90000    Wendy
23   93000   Xavier
24   81000     Yara
25   78000     Zack
26   85000      Amy
27   89000      Ben
28   77000     Cara
29   92000      Dan

In [14]:
df['Salary'].mean()

np.float64(84466.66666666667)

In [17]:
df['Salary'].min().round(2)

np.int64(72000)

In [18]:
df[0]

KeyError: 0

In [19]:
df.loc[0]

Name              Alice
Age                  25
City           New York
Salary            75000
Department    Marketing
Name: 0, dtype: object

In [22]:
df.loc[15:20]

      Name  Age      City  Salary   Department
15    Paul   39    Boston   94000  Engineering
16   Quinn   32    Austin   80000        Sales
17  Rachel   37    Denver   87000           HR
18     Sam   29  Portland   82000    Marketing
19    Tina   43   Atlanta   96000  Engineering
20     Uma   31     Miami   79000        Sales